tap "buo/cask-upgrade"
tap "homebrew/cask-fonts"

# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

brew "mas"

cask "adobe-dng-converter"
cask "arq"
cask "betterdisplay"
cask "brave-browser"
cask "docker"
cask "font-fira-code-nerd-font"
#cask "github"
#cask "hammerspoon"
cask "hazel"
# cask "raycast"   # spotlight is better than it used to be
# cask "spotify" # no sha
cask "steermouse"
cask "stats"
# cask "steam" # no sha
cask "wezterm"
#cask "whisky"
cask "visual-studio-code"

mas "Affinity Photo 2", id: 1616822987
mas "Daisy Disk", id: 411643860
mas "Kindle", id: 405399194
mas "Microsoft Excel", id: 462058435
mas "Microsoft Word", id: 462054704
mas "1Password for Safari", id: 1569813296
mas "Home Assistant", id: 1099568401
mas "Numbers", id:  409203825
mas "Paprika Recipe Manager 3", id: 1303222628
mas "WireGuard", id: 1451685025
# mas "Save to Reader", id: 1640236961
# mas "Kagi Inc.", id: 1622835804
mas "Keynote", id: 409183694
mas "Pages", id: 409201541
#mas "AdGuard for Safari", id: 1440147259
mas "Soulver 3", id: 1508732804
mas "Darkroom", id: 953286746
mas "Pixelmator Pro", id: 1289583905
#mas "Hidden Bar", id: 1452453066
mas "Photomator", id: 1444636541
