tap "homebrew/services"
tap "buo/cask-upgrade"

# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

brew "mas"
brew "ollama", restart_service: true

cask "arq"
cask "bambu-studio"
cask "betterdisplay"
cask "cursor"
cask "eloston-chromium"
cask "font-fira-code-nerd-font"
cask "font-victor-mono-nerd-font"
# cask "mindmac" use zed instead.
cask "obsidian"
cask "orbstack"
cask "qmk-toolbox"
cask "reader"
cask "stats"
cask "steermouse", args: { appdir: "/Applications" }
cask "wezterm"
cask "zed"

#cask "adobe-dng-converter"
#cask "brave-browser"
#cask "docker"
#cask "hammerspoon"
#cask "hazel"
#cask "jordanbaird-ice" # menu bar manager.  needs too many perms
#cask "little-snitch"
#cask "microsoft-teams"
#cask "orion"
#cask "raycast"   # spotlight is better than it used to be
#cask "spotify" # no sha
#cask "steam" # no sha
#cask "visual-studio-code"

mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "Affinity Publisher 2", id: 1606941598
mas "Home Assistant", id: 1099568401
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Microsoft Excel", id: 462058435
mas "Microsoft Word", id: 462054704
mas "Noir", id: 1592917505
mas "Numbers", id:  409203825
mas "Pages", id: 409201541
mas "PDFgear", id: 6469021132
mas "Passepartout", id: 1433648537
mas "Soulver 3", id: 1508732804
mas "SponsorBlock", id: 1573461917
mas "StopTheMadness Pro", id: 6471380298
#mas "WireGuard", id: 1451685025
mas "xSearch", id: 1579902068


#mas "Daisy Disk", id: 411643860
#mas "Paprika Recipe Manager 3", id: 1303222628
#mas "Save to Reader", id: 1640236961
#mas "Affinity Photo 2", id: 1616822987
